about/about.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-06-03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>About — Jingtao Xu</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"/><link rel="stylesheet" href="/css/site.css"/>
</head>
<body>
<div id="preamble" class="status">
<nav class="site-nav"><a class="brand" href="/">Jingtao&nbsp;Xu</a><span class="nav-links"><a href="/about/about.html">About</a><a href="/#services">Work</a><a href="/writing.html">Writing</a><a href="/proof.html">Proof</a><a class="nav-cta" href="/contact.html">Connect</a></span></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">About — Jingtao Xu</h1>
</header><p>
I'm Jingtao, a software engineer in Hangzhou, China (UTC+8), with ~24 years
behind me. I think in Common Lisp, Clojure and Emacs; I like bending a language
until it fits the problem instead of the other way around; and I work in the
open. I write in fluent English and native Chinese.
</p>

<p>
If there's a through-line, it's <b>meta-programming</b>: from reverse-engineering
binaries at the instruction level, to expert systems, to the literate tooling I
author today, to developing with AI coding agents — I keep building the layer
that makes the real problem easier to express.
</p>
<div id="outline-container-org34b0bc1" class="outline-2">
<h2 id="org34b0bc1">The path so far</h2>
<div class="outline-text-2" id="text-org34b0bc1">
<ul class="org-ul">
<li><b>AI-augmented development (now)</b> — I develop with AI coding agents daily through
a literate org-mode workflow; authored emacs-agent (a native Emacs SDK for code
agents with org-mode as the interactive UI).</li>
<li><b>Meta-programming &amp; language engineering</b> — 20+ years of Common Lisp, Clojure
and Emacs Lisp; authored literate-lisp, literate-elisp, literate-clojure,
s-graphviz. Currently writing a Common Lisp implementation of the ECMAScript
specification (early stage).</li>
<li><b>Expert systems &amp; symbolic AI</b> — Gensym G2, a commercial real-time
expert-system platform (ANSI Common Lisp, LispWorks): root-cause fixes and new
features. NLP / BNF question parsing (English + Chinese).</li>
<li><b>Security &amp; reverse engineering (Kingsoft)</b> — antivirus-engine work and Windows
kernel-driver development; disassembling hostile binaries. Authored capstone
and cdb-mi.</li>
<li><b>Production Common Lisp</b> — shipped a commercial product written in ANSI CL,
<a href="http://www.lispworks.com/success-stories/ixiaozhushou.html">featured as a LispWorks success story</a>.</li>
</ul>
</div>
</div>
<div id="outline-container-org15656b1" class="outline-2">
<h2 id="org15656b1">Connect</h2>
<div class="outline-text-2" id="text-org15656b1">
<p>
I like meeting people who care about languages, agents and systems. Reach out to
share ideas or collaborate — and yes, I'm open to the right long-term
collaboration or full-time remote role, though no pretext is needed to say hello.
</p>

<ul class="org-ul">
<li>Email: <a href="mailto:dev@jingtao.net">dev@jingtao.net</a></li>
<li>Code: <a href="https://github.com/jingtao-net">github.com/jingtao-net</a> · <a href="https://github.com/jingtaozf">github.com/jingtaozf</a></li>
<li>Book a call: <a href="https://cal.com/jingtaoxu">cal.com/jingtaoxu</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="site-footer"><p>Remote · UTC+8 · fluent English / 中文</p><p><a href="mailto:dev@jingtao.net">dev@jingtao.net</a> · <a href="https://cal.com/jingtaoxu">Book a call</a> · <a href="https://github.com/jingtao-net">github.com/jingtao-net</a></p><p class="fineprint">© Jingtao Xu</p></footer>
</div>
</body>
</html>
